<?php
/**
 * 扩展配置
 */
return [

    //应用信息
    'app_version' => 'V 3.1 正式版',
    'app_name' => 'WeJoy CMF管理平台',
    'app_name_en' => 'WeJoy',
    'app_powered' => 'WeJoy CMF',
    'app_description' => '问道内容管理平台（WeJoy CMF），是资海自主研发的内容管理框架，让开发像游戏般快乐、简单、灵活、便捷。',
    'app_support' => '资海网络集团（ZhHai Group）',
    'app_support_site' => 'http://www.zihai0531.com',

	// 秘钥
    'auth_key' => 'LAFK872#$^%K9812)-!@SKdLsDdSFdsdjhgANjXLKJlslkjsdf(*(23)54#',
    'user_administrator' => '1',

    // 数据类型
    'setting_type' =>[
        'input'    => '单行',
        'textarea' => '多行',
        'img' => '图片',
        'editor' => '编辑器',
        'radio'    => '单选',
    ],

    'order' => [
        'order_id' => 'desc',
        'id' => 'desc',
    ],
    // 数据库备份路径
    'backup_path' => ROOT_PATH . 'data' . DS . 'backup'.DS,




    //商品规格类型
    'spec_model' =>[
        'text' => '文字',        
    ],

    //留言消息类型
    'message_type' => [
        '1' => '普通留言',         
    ],

    //案例配置
    'color' =>[
	    'red'   => '红色',
        '#D2B46E'  => '金色',
	    'blue'  => '蓝色',
	    'black' => '黑色',
	    'white' => '白色',
    ],
    'price' => [
    	'1' => '1万以下',
    	'2' => '1万~3万',
    	'3' => '3万~5万',
    	'4' => '5万~8万',
    	'5' => '8万~10万',
    	'6' => '10万~15万',
    	'7' => '15万~20万',
    	'8' => '20万~50万',
    	'9' => '50万以上',
    ],
    // 用户在线时间
    'online_time'   => 60 * 30,

    // 用户名密码有效期，0表示永不过期
    'password_time' => 60 * 30,


    'sex' => [
        '0' => '男',
        '1' => '女',
    ],

    'id_type' => [
        '0' => '身份证',
        '2' => '军官证',
        '5' => '港澳通行证',
        '8' => '台胞证',
    ],

    // 投保人职业类别
    'occupation_type' => [
        '1020202' => '企业经理',
        '8010104' => '家庭主妇',
        '2020906' => '一般工程科技技术人员',
        '8010101' => '无固定职业人员（以收取各种租金维持生计的）',
        '2090101' => '一般大中小学教师',
        '2070501' => '金融一般内勤人员',
        '8010102' => '离退休人员（无兼职）',
        '3010101' => '单位文职内勤',
        '2050102' => '医护人员',
        '3010102' => '外勤商旅餐饮',
        '6230608' => '农牧钢塑装潢',
        '5030206' => '渔港采砂水泥',
        '6240103' => '自用客货车、出租车司机',
        '6230902' => '电力建筑机械',
        '6240112' => '沙石工程罐车司机',
        '6230618' => '高空海上航空',
    ],
    'relation' => [
        '00' => '本人',
        '01' => '父子',
        '02' => '父女',
        '03' => '母子',
        '04' => '母女',
        '07' => '夫妻',
    ],
];